In [1]:
%load_ext sql
DB_ENDPOINT = '127.0.0.1'
DB = 'sakila'
DB_USER = 'postgres'
DB_PASSWORD = '1234'
DB_PORT = '5432'

conn_string = 'postgresql://{}:{}@{}:{}/{}'\
                .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)
print(conn_string)
%sql $conn_string

postgresql://postgres:1234@127.0.0.1:5432/sakila

#### The Facts table has all the needed dimensions, no need for deep joins.

In [2]:
%%time
%%sql
SELECT movie_key, date_key, customer_key, sales_amount FROM factSales LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/sakila
5 rows affected.
CPU times: user 5.15 ms, sys: 2.87 ms, total: 8.03 ms
Wall time: 54.5 ms

[(663, 20050525, 1, Decimal('2.99')),
 (875, 20050528, 1, Decimal('0.99')),
 (611, 20050615, 1, Decimal('5.99')),
 (228, 20050615, 1, Decimal('0.99')),
 (308, 20050615, 1, Decimal('9.99'))]

---
Join Fact table with Dimensions to replace keys with attributes

In [3]:
%%time
%%sql
SELECT dimMovie.title, dimDate.month, dimCustomer.city, sales_amount
FROM factSales
JOIN dimMovie ON (dimMovie.movie_key = factSales.movie_key)
JOIN dimDate ON (dimDate.date_key = factSales.date_key)
JOIN dimCustomer ON (dimCustomer.customer_key = factSales.customer_key)
LIMIT 5

 * postgresql://postgres:***@127.0.0.1:5432/sakila
5 rows affected.
CPU times: user 6.52 ms, sys: 2.91 ms, total: 9.43 ms
Wall time: 81.7 ms

[('PATIENT SISTER', 5, 'Sasebo', Decimal('2.99')),
 ('TALENTED HOMICIDE', 5, 'Sasebo', Decimal('0.99')),
 ('MUSKETEERS WAIT', 6, 'Sasebo', Decimal('5.99')),
 ('DETECTIVE VISION', 6, 'Sasebo', Decimal('0.99')),
 ('FERRIS MOTHER', 6, 'Sasebo', Decimal('9.99'))]

In [4]:
%%time
%%sql
SELECT dimMovie.title, dimDate.month, dimCustomer.city, sum(sales_amount) as revenue
FROM factSales
JOIN dimMovie ON (dimMovie.movie_key = factSales.movie_key)
JOIN dimDate ON (dimDate.date_key = factSales.date_key)
JOIN dimCustomer ON (dimCustomer.customer_key = factSales.customer_key)
GROUP BY (dimMovie.title, dimCustomer.city, dimDate.month)
ORDER BY  dimDate.month, revenue DESC
LIMIT 5

 * postgresql://postgres:***@127.0.0.1:5432/sakila
5 rows affected.
CPU times: user 8.16 ms, sys: 3.36 ms, total: 11.5 ms
Wall time: 165 ms

[('BOOGIE AMELIE', 2, 'Jaipur', Decimal('19.96')),
 ('LUST LOCK', 2, 'Changhwa', Decimal('17.94')),
 ('HYDE DOCTOR', 2, 'Bern', Decimal('15.96')),
 ('LUST LOCK', 2, 'Lengshuijiang', Decimal('15.96')),
 ('PEACH INNOCENT', 2, 'Nagareyama', Decimal('15.96'))]

In [5]:
%%time
%%sql 
SELECT f.title, EXTRACT(month FROM p.payment_date) as month, ci.city,  sum(p.amount) as revenue
FROM payment p
JOIN rental r ON (p.rental_id = r.rental_id)
JOIN inventory i ON (i.inventory_id = r.inventory_id)
JOIN film f ON (i.film_id = f.film_id)
JOIN customer c ON (p.customer_id = c.customer_id)
JOIN address a ON (a.address_id = c.address_id)
JOIN city ci ON (a.city_id = ci.city_id)
GROUP BY (f.title, ci.city, month)
ORDER BY month, revenue DESC
LIMIT 5

 * postgresql://postgres:***@127.0.0.1:5432/sakila
5 rows affected.
CPU times: user 9.18 ms, sys: 2.56 ms, total: 11.7 ms
Wall time: 200 ms

[('BOOGIE AMELIE', 2.0, 'Jaipur', Decimal('9.98')),
 ('LUST LOCK', 2.0, 'Changhwa', Decimal('8.97')),
 ('HYDE DOCTOR', 2.0, 'Bern', Decimal('7.98')),
 ('LUST LOCK', 2.0, 'Lengshuijiang', Decimal('7.98')),
 ('PEACH INNOCENT', 2.0, 'Nagareyama', Decimal('7.98'))]